SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32SG28/Include/efr32sg28_cmu.h
/**************************************************************************//**
 * @file
 * @brief EFR32SG28 CMU register and bit field definitions
 ******************************************************************************
 * # License
 * <b>Copyright 2023 Silicon Laboratories, Inc. www.silabs.com</b>
 ******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 * 
 * The licensor of this software is Silicon Laboratories Inc.
 * 
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 * 
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 * 
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 *****************************************************************************/
#ifndef EFR32SG28_CMU_H
#define EFR32SG28_CMU_H

#define CMU_HAS_SET_CLEAR

/**************************************************************************//**
* @addtogroup Parts
* @{
******************************************************************************/
/**************************************************************************//**
 * @defgroup EFR32SG28_CMU CMU
 * @{
 * @brief EFR32SG28 CMU Register Declaration.
 *****************************************************************************/

/** CMU Register Declaration. */
typedef struct
{
  __IM  uint32_t             IPVERSION;              /**< IP version ID                                      */
        uint32_t             RESERVED0[1U];          /**< Reserved for future use                            */
  __IM  uint32_t             STATUS;                 /**< Status Register                                    */
        uint32_t             RESERVED1[1U];          /**< Reserved for future use                            */
  __IOM uint32_t             LOCK;                   /**< Configuration Lock Register                        */
  __IOM uint32_t             WDOGLOCK;               /**< WDOG Configuration Lock Register                   */
        uint32_t             RESERVED2[2U];          /**< Reserved for future use                            */
  __IOM uint32_t             IF;                     /**< Interrupt Flag Register                            */
  __IOM uint32_t             IEN;                    /**< Interrupt Enable Register                          */
        uint32_t             RESERVED3[10U];         /**< Reserved for future use                            */
  __IOM uint32_t             CALCMD;                 /**< Calibration Command Register                       */
  __IOM uint32_t             CALCTRL;                /**< Calibration Control Register                       */
  __IM  uint32_t             CALCNT;                 /**< Calibration Result Counter Register                */
        uint32_t             RESERVED4[2U];          /**< Reserved for future use                            */
  __IOM uint32_t             CLKEN0;                 /**< Clock Enable Register 0                            */
  __IOM uint32_t             CLKEN1;                 /**<  Clock Enable Register 1                           */
        uint32_t             RESERVED5[1U];          /**< Reserved for future use                            */
  __IOM uint32_t             SYSCLKCTRL;             /**< System Clock Control                               */
        uint32_t             RESERVED6[3U];          /**< Reserved for future use                            */
  __IOM uint32_t             TRACECLKCTRL;           /**< Debug Trace Clock Control                          */
        uint32_t             RESERVED7[3U];          /**< Reserved for future use                            */
  __IOM uint32_t             EXPORTCLKCTRL;          /**< Export Clock Control                               */
        uint32_t             RESERVED8[27U];         /**< Reserved for future use                            */
  __IOM uint32_t             DPLLREFCLKCTRL;         /**< Digital PLL Reference Clock Control                */
        uint32_t             RESERVED9[7U];          /**< Reserved for future use                            */
  __IOM uint32_t             EM01GRPACLKCTRL;        /**< EM01 Peripheral Group A Clock Control              */
        uint32_t             RESERVED10[1U];         /**< Reserved for future use                            */
  __IOM uint32_t             EM01GRPCCLKCTRL;        /**< EM01 Peripheral Group C Clock Control              */
        uint32_t             RESERVED11[5U];         /**< Reserved for future use                            */
  __IOM uint32_t             EM23GRPACLKCTRL;        /**< EM23 Peripheral Group A Clock Control              */
        uint32_t             RESERVED12[7U];         /**< Reserved for future use                            */
  __IOM uint32_t             EM4GRPACLKCTRL;         /**< EM4 Peripheral Group A Clock Control               */
        uint32_t             RESERVED13[7U];         /**< Reserved for future use                            */
  __IOM uint32_t             IADCCLKCTRL;            /**< IADC Clock Control                                 */
        uint32_t             RESERVED14[31U];        /**< Reserved for future use                            */
  __IOM uint32_t             WDOG0CLKCTRL;           /**< Watchdog0 Clock Control                            */
        uint32_t             RESERVED15[1U];         /**< Reserved for future use                            */
  __IOM uint32_t             WDOG1CLKCTRL;           /**< Watchdog1 Clock Control                            */
        uint32_t             RESERVED16[5U];         /**< Reserved for future use                            */
  __IOM uint32_t             EUSART0CLKCTRL;         /**< EUSART0 Clock Control                              */
        uint32_t             RESERVED17[7U];         /**< Reserved for future use                            */
  __IOM uint32_t             SYSRTC0CLKCTRL;         /**< System RTC0 Clock Control                          */
        uint32_t             RESERVED18[3U];         /**< Reserved for future use                            */
  __IOM uint32_t             LCDCLKCTRL;             /**< LCD Clock Control                                  */
        uint32_t             RESERVED19[3U];         /**< Reserved for future use                            */
  __IOM uint32_t             VDAC0CLKCTRL;           /**< VDAC0 Clock Control                                */
        uint32_t             RESERVED20[3U];         /**< Reserved for future use                            */
  __IOM uint32_t             PCNT0CLKCTRL;           /**< Pulse counter 0 Clock Control                      */
        uint32_t             RESERVED21[3U];         /**< Reserved for future use                            */
  __IOM uint32_t             RADIOCLKCTRL;           /**< Radio Clock Control                                */
        uint32_t             RESERVED22[3U];         /**< Reserved for future use                            */
  __IOM uint32_t             LESENSEHFCLKCTRL;       /**< LESENSE HF Clock Control                           */
        uint32_t             RESERVED23[1U];    /**< Reserved for future use                            */
        uint32_t             RESERVED24[1U];         /**< Reserved for future use                            */
        uint32_t             RESERVED25[857U];  /**< Reserved for future use                            */
  __IM  uint32_t             IPVERSION_SET;          /**< IP version ID                                      */
        uint32_t             RESERVED26[1U];         /**< Reserved for future use                            */
  __IM  uint32_t             STATUS_SET;             /**< Status Register                                    */
        uint32_t             RESERVED27[1U];         /**< Reserved for future use                            */
  __IOM uint32_t             LOCK_SET;               /**< Configuration Lock Register                        */
  __IOM uint32_t             WDOGLOCK_SET;           /**< WDOG Configuration Lock Register                   */
        uint32_t             RESERVED28[2U];         /**< Reserved for future use                            */
  __IOM uint32_t             IF_SET;                 /**< Interrupt Flag Register                            */
  __IOM uint32_t             IEN_SET;                /**< Interrupt Enable Register                          */
        uint32_t             RESERVED29[10U];        /**< Reserved for future use                            */
  __IOM uint32_t             CALCMD_SET;             /**< Calibration Command Register                       */
  __IOM uint32_t             CALCTRL_SET;            /**< Calibration Control Register                       */
  __IM  uint32_t             CALCNT_SET;             /**< Calibration Result Counter Register                */
        uint32_t             RESERVED30[2U];         /**< Reserved for future use                            */
  __IOM uint32_t             CLKEN0_SET;             /**< Clock Enable Register 0                            */
  __IOM uint32_t             CLKEN1_SET;             /**<  Clock Enable Register 1                           */
        uint32_t             RESERVED31[1U];         /**< Reserved for future use                            */
  __IOM uint32_t             SYSCLKCTRL_SET;         /**< System Clock Control                               */
        uint32_t             RESERVED32[3U];         /**< Reserved for future use                            */
  __IOM uint32_t             TRACECLKCTRL_SET;       /**< Debug Trace Clock Control                          */
        uint32_t             RESERVED33[3U];         /**< Reserved for future use                            */
  __IOM uint32_t             EXPORTCLKCTRL_SET;      /**< Export Clock Control                               */
        uint32_t             RESERVED34[27U];        /**< Reserved for future use                            */
  __IOM uint32_t             DPLLREFCLKCTRL_SET;     /**< Digital PLL Reference Clock Control                */
        uint32_t             RESERVED35[7U];         /**< Reserved for future use                            */
  __IOM uint32_t             EM01GRPACLKCTRL_SET;    /**< EM01 Peripheral Group A Clock Control              */
        uint32_t             RESERVED36[1U];         /**< Reserved for future use                            */
  __IOM uint32_t             EM01GRPCCLKCTRL_SET;    /**< EM01 Peripheral Group C Clock Control              */
        uint32_t             RESERVED37[5U];         /**< Reserved for future use                            */
  __IOM uint32_t             EM23GRPACLKCTRL_SET;    /**< EM23 Peripheral Group A Clock Control              */
        uint32_t             RESERVED38[7U];         /**< Reserved for future use                            */
  __IOM uint32_t             EM4GRPACLKCTRL_SET;     /**< EM4 Peripheral Group A Clock Control               */
        uint32_t             RESERVED39[7U];         /**< Reserved for future use                            */
  __IOM uint32_t             IADCCLKCTRL_SET;        /**< IADC Clock Control                                 */
        uint32_t             RESERVED40[31U];        /**< Reserved for future use                            */
  __IOM uint32_t             WDOG0CLKCTRL_SET;       /**< Watchdog0 Clock Control                            */
        uint32_t             RESERVED41[1U];         /**< Reserved for future use                            */
  __IOM uint32_t             WDOG1CLKCTRL_SET;       /**< Watchdog1 Clock Control                            */
        uint32_t             RESERVED42[5U];         /**< Reserved for future use                            */
  __IOM uint32_t             EUSART0CLKCTRL_SET;     /**< EUSART0 Clock Control                              */
        uint32_t             RESERVED43[7U];         /**< Reserved for future use                            */
  __IOM uint32_t             SYSRTC0CLKCTRL_SET;     /**< System RTC0 Clock Control                          */
        uint32_t             RESERVED44[3U];         /**< Reserved for future use                            */
  __IOM uint32_t             LCDCLKCTRL_SET;         /**< LCD Clock Control                                  */
        uint32_t             RESERVED45[3U];         /**< Reserved for future use                            */
  __IOM uint32_t             VDAC0CLKCTRL_SET;       /**< VDAC0 Clock Control                                */
        uint32_t             RESERVED46[3U];         /**< Reserved for future use                            */
  __IOM uint32_t             PCNT0CLKCTRL_SET;       /**< Pulse counter 0 Clock Control                      */
        uint32_t             RESERVED47[3U];         /**< Reserved for future use                            */
  __IOM uint32_t             RADIOCLKCTRL_SET;       /**< Radio Clock Control                                */
        uint32_t             RESERVED48[3U];         /**< Reserved for future use                            */
  __IOM uint32_t             LESENSEHFCLKCTRL_SET;   /**< LESENSE HF Clock Control                           */
        uint32_t             RESERVED49[1U];    /**< Reserved for future use                            */
        uint32_t             RESERVED50[1U];         /**< Reserved for future use                            */
        uint32_t             RESERVED51[857U];  /**< Reserved for future use                            */
  __IM  uint32_t             IPVERSION_CLR;          /**< IP version ID                                      */
        uint32_t             RESERVED52[1U];         /**< Reserved for future use                            */
  __IM  uint32_t             STATUS_CLR;             /**< Status Register                                    */
        uint32_t             RESERVED53[1U];         /**< Reserved for future use                            */
  __IOM uint32_t             LOCK_CLR;               /**< Configuration Lock Register                        */
  __IOM uint32_t             WDOGLOCK_CLR;           /**< WDOG Configuration Lock Register                   */
        uint32_t             RESERVED54[2U];         /**< Reserved for future use                            */
  __IOM uint32_t             IF_CLR;                 /**< Interrupt Flag Register                            */
  __IOM uint32_t             IEN_CLR;                /**< Interrupt Enable Register                          */
        uint32_t             RESERVED55[10U];        /**< Reserved for future use                            */
  __IOM uint32_t             CALCMD_CLR;             /**< Calibration Command Register                       */
  __IOM uint32_t             CALCTRL_CLR;            /**< Calibration Control Register                       */
  __IM  uint32_t             CALCNT_CLR;             /**< Calibration Result Counter Register                */
        uint32_t             RESERVED56[2U];         /**< Reserved for future use                            */
  __IOM uint32_t             CLKEN0_CLR;             /**< Clock Enable Register 0                            */
  __IOM uint32_t             CLKEN1_CLR;             /**<  Clock Enable Register 1                           */
        uint32_t             RESERVED57[1U];         /**< Reserved for future use                            */
  __IOM uint32_t             SYSCLKCTRL_CLR;         /**< System Clock Control                               */
        uint32_t             RESERVED58[3U];         /**< Reserved for future use                            */
  __IOM uint32_t             TRACECLKCTRL_CLR;       /**< Debug Trace Clock Control                          */
        uint32_t             RESERVED59[3U];         /**< Reserved for future use                            */
  __IOM uint32_t             EXPORTCLKCTRL_CLR;      /**< Export Clock Control                               */
        uint32_t             RESERVED60[27U];        /**< Reserved for future use                            */
  __IOM uint32_t             DPLLREFCLKCTRL_CLR;     /**< Digital PLL Reference Clock Control                */
        uint32_t             RESERVED61[7U];         /**< Reserved for future use                            */
  __IOM uint32_t             EM01GRPACLKCTRL_CLR;    /**< EM01 Peripheral Group A Clock Control              */
        uint32_t             RESERVED62[1U];         /**< Reserved for future use                            */
  __IOM uint32_t             EM01GRPCCLKCTRL_CLR;    /**< EM01 Peripheral Group C Clock Control              */
        uint32_t             RESERVED63[5U];         /**< Reserved for future use                            */
  __IOM uint32_t             EM23GRPACLKCTRL_CLR;    /**< EM23 Peripheral Group A Clock Control              */
        uint32_t             RESERVED64[7U];         /**< Reserved for future use                            */
  __IOM uint32_t             EM4GRPACLKCTRL_CLR;     /**< EM4 Peripheral Group A Clock Control               */
        uint32_t             RESERVED65[7U];         /**< Reserved for future use                            */
  __IOM uint32_t             IADCCLKCTRL_CLR;        /**< IADC Clock Control                                 */
        uint32_t             RESERVED66[31U];        /**< Reserved for future use                            */
  __IOM uint32_t             WDOG0CLKCTRL_CLR;       /**< Watchdog0 Clock Control                            */
        uint32_t             RESERVED67[1U];         /**< Reserved for future use                            */
  __IOM uint32_t             WDOG1CLKCTRL_CLR;       /**< Watchdog1 Clock Control                            */
        uint32_t             RESERVED68[5U];         /**< Reserved for future use                            */
  __IOM uint32_t             EUSART0CLKCTRL_CLR;     /**< EUSART0 Clock Control                              */
        uint32_t             RESERVED69[7U];         /**< Reserved for future use                            */
  __IOM uint32_t             SYSRTC0CLKCTRL_CLR;     /**< System RTC0 Clock Control                          */
        uint32_t             RESERVED70[3U];         /**< Reserved for future use                            */
  __IOM uint32_t             LCDCLKCTRL_CLR;         /**< LCD Clock Control                                  */
        uint32_t             RESERVED71[3U];         /**< Reserved for future use                            */
  __IOM uint32_t             VDAC0CLKCTRL_CLR;       /**< VDAC0 Clock Control                                */
        uint32_t             RESERVED72[3U];         /**< Reserved for future use                            */
  __IOM uint32_t             PCNT0CLKCTRL_CLR;       /**< Pulse counter 0 Clock Control                      */
        uint32_t             RESERVED73[3U];         /**< Reserved for future use                            */
  __IOM uint32_t             RADIOCLKCTRL_CLR;       /**< Radio Clock Control                                */
        uint32_t             RESERVED74[3U];         /**< Reserved for future use                            */
  __IOM uint32_t             LESENSEHFCLKCTRL_CLR;   /**< LESENSE HF Clock Control                           */
        uint32_t             RESERVED75[1U];    /**< Reserved for future use                            */
        uint32_t             RESERVED76[1U];         /**< Reserved for future use                            */
        uint32_t             RESERVED77[857U];  /**< Reserved for future use                            */
  __IM  uint32_t             IPVERSION_TGL;          /**< IP version ID                                      */
        uint32_t             RESERVED78[1U];         /**< Reserved for future use                            */
  __IM  uint32_t             STATUS_TGL;             /**< Status Register                                    */
        uint32_t             RESERVED79[1U];         /**< Reserved for future use                            */
  __IOM uint32_t             LOCK_TGL;               /**< Configuration Lock Register                        */
  __IOM uint32_t             WDOGLOCK_TGL;           /**< WDOG Configuration Lock Register                   */
        uint32_t             RESERVED80[2U];         /**< Reserved for future use                            */
  __IOM uint32_t             IF_TGL;                 /**< Interrupt Flag Register                            */
  __IOM uint32_t             IEN_TGL;                /**< Interrupt Enable Register                          */
        uint32_t             RESERVED81[10U];        /**< Reserved for future use                            */
  __IOM uint32_t             CALCMD_TGL;             /**< Calibration Command Register                       */
  __IOM uint32_t             CALCTRL_TGL;            /**< Calibration Control Register                       */
  __IM  uint32_t             CALCNT_TGL;             /**< Calibration Result Counter Register                */
        uint32_t             RESERVED82[2U];         /**< Reserved for future use                            */
  __IOM uint32_t             CLKEN0_TGL;             /**< Clock Enable Register 0                            */
  __IOM uint32_t             CLKEN1_TGL;             /**<  Clock Enable Register 1                           */
        uint32_t             RESERVED83[1U];         /**< Reserved for future use                            */
  __IOM uint32_t             SYSCLKCTRL_TGL;         /**< System Clock Control                               */
        uint32_t             RESERVED84[3U];         /**< Reserved for future use                            */
  __IOM uint32_t             TRACECLKCTRL_TGL;       /**< Debug Trace Clock Control                          */
        uint32_t             RESERVED85[3U];         /**< Reserved for future use                            */
  __IOM uint32_t             EXPORTCLKCTRL_TGL;      /**< Export Clock Control                               */
        uint32_t             RESERVED86[27U];        /**< Reserved for future use                            */
  __IOM uint32_t             DPLLREFCLKCTRL_TGL;     /**< Digital PLL Reference Clock Control                */
        uint32_t             RESERVED87[7U];         /**< Reserved for future use                            */
  __IOM uint32_t             EM01GRPACLKCTRL_TGL;    /**< EM01 Peripheral Group A Clock Control              */
        uint32_t             RESERVED88[1U];         /**< Reserved for future use                            */
  __IOM uint32_t             EM01GRPCCLKCTRL_TGL;    /**< EM01 Peripheral Group C Clock Control              */
        uint32_t             RESERVED89[5U];         /**< Reserved for future use                            */
  __IOM uint32_t             EM23GRPACLKCTRL_TGL;    /**< EM23 Peripheral Group A Clock Control              */
        uint32_t             RESERVED90[7U];         /**< Reserved for future use                            */
