SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32SG28/Include/efr32sg28_cmu.h
  __IOM uint32_t             EM4GRPACLKCTRL_TGL;     /**< EM4 Peripheral Group A Clock Control               */
        uint32_t             RESERVED91[7U];         /**< Reserved for future use                            */
  __IOM uint32_t             IADCCLKCTRL_TGL;        /**< IADC Clock Control                                 */
        uint32_t             RESERVED92[31U];        /**< Reserved for future use                            */
  __IOM uint32_t             WDOG0CLKCTRL_TGL;       /**< Watchdog0 Clock Control                            */
        uint32_t             RESERVED93[1U];         /**< Reserved for future use                            */
  __IOM uint32_t             WDOG1CLKCTRL_TGL;       /**< Watchdog1 Clock Control                            */
        uint32_t             RESERVED94[5U];         /**< Reserved for future use                            */
  __IOM uint32_t             EUSART0CLKCTRL_TGL;     /**< EUSART0 Clock Control                              */
        uint32_t             RESERVED95[7U];         /**< Reserved for future use                            */
  __IOM uint32_t             SYSRTC0CLKCTRL_TGL;     /**< System RTC0 Clock Control                          */
        uint32_t             RESERVED96[3U];         /**< Reserved for future use                            */
  __IOM uint32_t             LCDCLKCTRL_TGL;         /**< LCD Clock Control                                  */
        uint32_t             RESERVED97[3U];         /**< Reserved for future use                            */
  __IOM uint32_t             VDAC0CLKCTRL_TGL;       /**< VDAC0 Clock Control                                */
        uint32_t             RESERVED98[3U];         /**< Reserved for future use                            */
  __IOM uint32_t             PCNT0CLKCTRL_TGL;       /**< Pulse counter 0 Clock Control                      */
        uint32_t             RESERVED99[3U];         /**< Reserved for future use                            */
  __IOM uint32_t             RADIOCLKCTRL_TGL;       /**< Radio Clock Control                                */
        uint32_t             RESERVED100[3U];        /**< Reserved for future use                            */
  __IOM uint32_t             LESENSEHFCLKCTRL_TGL;   /**< LESENSE HF Clock Control                           */
        uint32_t             RESERVED101[1U];   /**< Reserved for future use                            */
        uint32_t             RESERVED102[1U];        /**< Reserved for future use                            */
} CMU_TypeDef;
/** @} End of group EFR32SG28_CMU */

/**************************************************************************//**
 * @addtogroup EFR32SG28_CMU
 * @{
 * @defgroup EFR32SG28_CMU_BitFields CMU Bit Fields
 * @{
 *****************************************************************************/

/* Bit fields for CMU IPVERSION */
#define _CMU_IPVERSION_RESETVALUE               0x00000006UL                            /**< Default value for CMU_IPVERSION             */
#define _CMU_IPVERSION_MASK                     0xFFFFFFFFUL                            /**< Mask for CMU_IPVERSION                      */
#define _CMU_IPVERSION_IPVERSION_SHIFT          0                                       /**< Shift value for CMU_IPVERSION               */
#define _CMU_IPVERSION_IPVERSION_MASK           0xFFFFFFFFUL                            /**< Bit mask for CMU_IPVERSION                  */
#define _CMU_IPVERSION_IPVERSION_DEFAULT        0x00000006UL                            /**< Mode DEFAULT for CMU_IPVERSION              */
#define CMU_IPVERSION_IPVERSION_DEFAULT         (_CMU_IPVERSION_IPVERSION_DEFAULT << 0) /**< Shifted mode DEFAULT for CMU_IPVERSION      */

/* Bit fields for CMU STATUS */
#define _CMU_STATUS_RESETVALUE                  0x00000000UL                            /**< Default value for CMU_STATUS                */
#define _CMU_STATUS_MASK                        0xC0038001UL                            /**< Mask for CMU_STATUS                         */
#define CMU_STATUS_CALRDY                       (0x1UL << 0)                            /**< Calibration Ready                           */
#define _CMU_STATUS_CALRDY_SHIFT                0                                       /**< Shift value for CMU_CALRDY                  */
#define _CMU_STATUS_CALRDY_MASK                 0x1UL                                   /**< Bit mask for CMU_CALRDY                     */
#define _CMU_STATUS_CALRDY_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for CMU_STATUS                 */
#define CMU_STATUS_CALRDY_DEFAULT               (_CMU_STATUS_CALRDY_DEFAULT << 0)       /**< Shifted mode DEFAULT for CMU_STATUS         */
#define CMU_STATUS_WDOGLOCK                     (0x1UL << 30)                           /**< Configuration Lock Status for WDOG          */
#define _CMU_STATUS_WDOGLOCK_SHIFT              30                                      /**< Shift value for CMU_WDOGLOCK                */
#define _CMU_STATUS_WDOGLOCK_MASK               0x40000000UL                            /**< Bit mask for CMU_WDOGLOCK                   */
#define _CMU_STATUS_WDOGLOCK_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for CMU_STATUS                 */
#define _CMU_STATUS_WDOGLOCK_UNLOCKED           0x00000000UL                            /**< Mode UNLOCKED for CMU_STATUS                */
#define _CMU_STATUS_WDOGLOCK_LOCKED             0x00000001UL                            /**< Mode LOCKED for CMU_STATUS                  */
#define CMU_STATUS_WDOGLOCK_DEFAULT             (_CMU_STATUS_WDOGLOCK_DEFAULT << 30)    /**< Shifted mode DEFAULT for CMU_STATUS         */
#define CMU_STATUS_WDOGLOCK_UNLOCKED            (_CMU_STATUS_WDOGLOCK_UNLOCKED << 30)   /**< Shifted mode UNLOCKED for CMU_STATUS        */
#define CMU_STATUS_WDOGLOCK_LOCKED              (_CMU_STATUS_WDOGLOCK_LOCKED << 30)     /**< Shifted mode LOCKED for CMU_STATUS          */
#define CMU_STATUS_LOCK                         (0x1UL << 31)                           /**< Configuration Lock Status                   */
#define _CMU_STATUS_LOCK_SHIFT                  31                                      /**< Shift value for CMU_LOCK                    */
#define _CMU_STATUS_LOCK_MASK                   0x80000000UL                            /**< Bit mask for CMU_LOCK                       */
#define _CMU_STATUS_LOCK_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for CMU_STATUS                 */
#define _CMU_STATUS_LOCK_UNLOCKED               0x00000000UL                            /**< Mode UNLOCKED for CMU_STATUS                */
#define _CMU_STATUS_LOCK_LOCKED                 0x00000001UL                            /**< Mode LOCKED for CMU_STATUS                  */
#define CMU_STATUS_LOCK_DEFAULT                 (_CMU_STATUS_LOCK_DEFAULT << 31)        /**< Shifted mode DEFAULT for CMU_STATUS         */
#define CMU_STATUS_LOCK_UNLOCKED                (_CMU_STATUS_LOCK_UNLOCKED << 31)       /**< Shifted mode UNLOCKED for CMU_STATUS        */
#define CMU_STATUS_LOCK_LOCKED                  (_CMU_STATUS_LOCK_LOCKED << 31)         /**< Shifted mode LOCKED for CMU_STATUS          */

/* Bit fields for CMU LOCK */
#define _CMU_LOCK_RESETVALUE                    0x000093F7UL                            /**< Default value for CMU_LOCK                  */
#define _CMU_LOCK_MASK                          0x0000FFFFUL                            /**< Mask for CMU_LOCK                           */
#define _CMU_LOCK_LOCKKEY_SHIFT                 0                                       /**< Shift value for CMU_LOCKKEY                 */
#define _CMU_LOCK_LOCKKEY_MASK                  0xFFFFUL                                /**< Bit mask for CMU_LOCKKEY                    */
#define _CMU_LOCK_LOCKKEY_DEFAULT               0x000093F7UL                            /**< Mode DEFAULT for CMU_LOCK                   */
#define _CMU_LOCK_LOCKKEY_UNLOCK                0x000093F7UL                            /**< Mode UNLOCK for CMU_LOCK                    */
#define CMU_LOCK_LOCKKEY_DEFAULT                (_CMU_LOCK_LOCKKEY_DEFAULT << 0)        /**< Shifted mode DEFAULT for CMU_LOCK           */
#define CMU_LOCK_LOCKKEY_UNLOCK                 (_CMU_LOCK_LOCKKEY_UNLOCK << 0)         /**< Shifted mode UNLOCK for CMU_LOCK            */

/* Bit fields for CMU WDOGLOCK */
#define _CMU_WDOGLOCK_RESETVALUE                0x00005257UL                            /**< Default value for CMU_WDOGLOCK              */
#define _CMU_WDOGLOCK_MASK                      0x0000FFFFUL                            /**< Mask for CMU_WDOGLOCK                       */
#define _CMU_WDOGLOCK_LOCKKEY_SHIFT             0                                       /**< Shift value for CMU_LOCKKEY                 */
#define _CMU_WDOGLOCK_LOCKKEY_MASK              0xFFFFUL                                /**< Bit mask for CMU_LOCKKEY                    */
#define _CMU_WDOGLOCK_LOCKKEY_DEFAULT           0x00005257UL                            /**< Mode DEFAULT for CMU_WDOGLOCK               */
#define _CMU_WDOGLOCK_LOCKKEY_UNLOCK            0x000093F7UL                            /**< Mode UNLOCK for CMU_WDOGLOCK                */
#define CMU_WDOGLOCK_LOCKKEY_DEFAULT            (_CMU_WDOGLOCK_LOCKKEY_DEFAULT << 0)    /**< Shifted mode DEFAULT for CMU_WDOGLOCK       */
#define CMU_WDOGLOCK_LOCKKEY_UNLOCK             (_CMU_WDOGLOCK_LOCKKEY_UNLOCK << 0)     /**< Shifted mode UNLOCK for CMU_WDOGLOCK        */

/* Bit fields for CMU IF */
#define _CMU_IF_RESETVALUE                      0x00000000UL                            /**< Default value for CMU_IF                    */
#define _CMU_IF_MASK                            0x00000003UL                            /**< Mask for CMU_IF                             */
#define CMU_IF_CALRDY                           (0x1UL << 0)                            /**< Calibration Ready Interrupt Flag            */
#define _CMU_IF_CALRDY_SHIFT                    0                                       /**< Shift value for CMU_CALRDY                  */
#define _CMU_IF_CALRDY_MASK                     0x1UL                                   /**< Bit mask for CMU_CALRDY                     */
#define _CMU_IF_CALRDY_DEFAULT                  0x00000000UL                            /**< Mode DEFAULT for CMU_IF                     */
#define CMU_IF_CALRDY_DEFAULT                   (_CMU_IF_CALRDY_DEFAULT << 0)           /**< Shifted mode DEFAULT for CMU_IF             */
#define CMU_IF_CALOF                            (0x1UL << 1)                            /**< Calibration Overflow Interrupt Flag         */
#define _CMU_IF_CALOF_SHIFT                     1                                       /**< Shift value for CMU_CALOF                   */
#define _CMU_IF_CALOF_MASK                      0x2UL                                   /**< Bit mask for CMU_CALOF                      */
#define _CMU_IF_CALOF_DEFAULT                   0x00000000UL                            /**< Mode DEFAULT for CMU_IF                     */
#define CMU_IF_CALOF_DEFAULT                    (_CMU_IF_CALOF_DEFAULT << 1)            /**< Shifted mode DEFAULT for CMU_IF             */

/* Bit fields for CMU IEN */
#define _CMU_IEN_RESETVALUE                     0x00000000UL                            /**< Default value for CMU_IEN                   */
#define _CMU_IEN_MASK                           0x00000003UL                            /**< Mask for CMU_IEN                            */
#define CMU_IEN_CALRDY                          (0x1UL << 0)                            /**< Calibration Ready Interrupt Enable          */
#define _CMU_IEN_CALRDY_SHIFT                   0                                       /**< Shift value for CMU_CALRDY                  */
#define _CMU_IEN_CALRDY_MASK                    0x1UL                                   /**< Bit mask for CMU_CALRDY                     */
#define _CMU_IEN_CALRDY_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for CMU_IEN                    */
#define CMU_IEN_CALRDY_DEFAULT                  (_CMU_IEN_CALRDY_DEFAULT << 0)          /**< Shifted mode DEFAULT for CMU_IEN            */
#define CMU_IEN_CALOF                           (0x1UL << 1)                            /**< Calibration Overflow Interrupt Enable       */
#define _CMU_IEN_CALOF_SHIFT                    1                                       /**< Shift value for CMU_CALOF                   */
#define _CMU_IEN_CALOF_MASK                     0x2UL                                   /**< Bit mask for CMU_CALOF                      */
#define _CMU_IEN_CALOF_DEFAULT                  0x00000000UL                            /**< Mode DEFAULT for CMU_IEN                    */
#define CMU_IEN_CALOF_DEFAULT                   (_CMU_IEN_CALOF_DEFAULT << 1)           /**< Shifted mode DEFAULT for CMU_IEN            */

/* Bit fields for CMU CALCMD */
#define _CMU_CALCMD_RESETVALUE                  0x00000000UL                            /**< Default value for CMU_CALCMD                */
#define _CMU_CALCMD_MASK                        0x00000003UL                            /**< Mask for CMU_CALCMD                         */
#define CMU_CALCMD_CALSTART                     (0x1UL << 0)                            /**< Calibration Start                           */
#define _CMU_CALCMD_CALSTART_SHIFT              0                                       /**< Shift value for CMU_CALSTART                */
#define _CMU_CALCMD_CALSTART_MASK               0x1UL                                   /**< Bit mask for CMU_CALSTART                   */
#define _CMU_CALCMD_CALSTART_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for CMU_CALCMD                 */
#define CMU_CALCMD_CALSTART_DEFAULT             (_CMU_CALCMD_CALSTART_DEFAULT << 0)     /**< Shifted mode DEFAULT for CMU_CALCMD         */
#define CMU_CALCMD_CALSTOP                      (0x1UL << 1)                            /**< Calibration Stop                            */
#define _CMU_CALCMD_CALSTOP_SHIFT               1                                       /**< Shift value for CMU_CALSTOP                 */
#define _CMU_CALCMD_CALSTOP_MASK                0x2UL                                   /**< Bit mask for CMU_CALSTOP                    */
#define _CMU_CALCMD_CALSTOP_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for CMU_CALCMD                 */
#define CMU_CALCMD_CALSTOP_DEFAULT              (_CMU_CALCMD_CALSTOP_DEFAULT << 1)      /**< Shifted mode DEFAULT for CMU_CALCMD         */

/* Bit fields for CMU CALCTRL */
#define _CMU_CALCTRL_RESETVALUE                 0x00000000UL                            /**< Default value for CMU_CALCTRL               */
#define _CMU_CALCTRL_MASK                       0xFF8FFFFFUL                            /**< Mask for CMU_CALCTRL                        */
#define _CMU_CALCTRL_CALTOP_SHIFT               0                                       /**< Shift value for CMU_CALTOP                  */
#define _CMU_CALCTRL_CALTOP_MASK                0xFFFFFUL                               /**< Bit mask for CMU_CALTOP                     */
#define _CMU_CALCTRL_CALTOP_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for CMU_CALCTRL                */
#define CMU_CALCTRL_CALTOP_DEFAULT              (_CMU_CALCTRL_CALTOP_DEFAULT << 0)      /**< Shifted mode DEFAULT for CMU_CALCTRL        */
#define CMU_CALCTRL_CONT                        (0x1UL << 23)                           /**< Continuous Calibration                      */
#define _CMU_CALCTRL_CONT_SHIFT                 23                                      /**< Shift value for CMU_CONT                    */
#define _CMU_CALCTRL_CONT_MASK                  0x800000UL                              /**< Bit mask for CMU_CONT                       */
#define _CMU_CALCTRL_CONT_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for CMU_CALCTRL                */
#define CMU_CALCTRL_CONT_DEFAULT                (_CMU_CALCTRL_CONT_DEFAULT << 23)       /**< Shifted mode DEFAULT for CMU_CALCTRL        */
#define _CMU_CALCTRL_UPSEL_SHIFT                24                                      /**< Shift value for CMU_UPSEL                   */
#define _CMU_CALCTRL_UPSEL_MASK                 0xF000000UL                             /**< Bit mask for CMU_UPSEL                      */
#define _CMU_CALCTRL_UPSEL_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for CMU_CALCTRL                */
#define _CMU_CALCTRL_UPSEL_DISABLED             0x00000000UL                            /**< Mode DISABLED for CMU_CALCTRL               */
#define _CMU_CALCTRL_UPSEL_PRS                  0x00000001UL                            /**< Mode PRS for CMU_CALCTRL                    */
#define _CMU_CALCTRL_UPSEL_HFXO                 0x00000002UL                            /**< Mode HFXO for CMU_CALCTRL                   */
#define _CMU_CALCTRL_UPSEL_LFXO                 0x00000003UL                            /**< Mode LFXO for CMU_CALCTRL                   */
#define _CMU_CALCTRL_UPSEL_HFRCODPLL            0x00000004UL                            /**< Mode HFRCODPLL for CMU_CALCTRL              */
#define _CMU_CALCTRL_UPSEL_HFRCOEM23            0x00000005UL                            /**< Mode HFRCOEM23 for CMU_CALCTRL              */
#define _CMU_CALCTRL_UPSEL_FSRCO                0x00000008UL                            /**< Mode FSRCO for CMU_CALCTRL                  */
#define _CMU_CALCTRL_UPSEL_LFRCO                0x00000009UL                            /**< Mode LFRCO for CMU_CALCTRL                  */
#define _CMU_CALCTRL_UPSEL_ULFRCO               0x0000000AUL                            /**< Mode ULFRCO for CMU_CALCTRL                 */
#define CMU_CALCTRL_UPSEL_DEFAULT               (_CMU_CALCTRL_UPSEL_DEFAULT << 24)      /**< Shifted mode DEFAULT for CMU_CALCTRL        */
#define CMU_CALCTRL_UPSEL_DISABLED              (_CMU_CALCTRL_UPSEL_DISABLED << 24)     /**< Shifted mode DISABLED for CMU_CALCTRL       */
#define CMU_CALCTRL_UPSEL_PRS                   (_CMU_CALCTRL_UPSEL_PRS << 24)          /**< Shifted mode PRS for CMU_CALCTRL            */
#define CMU_CALCTRL_UPSEL_HFXO                  (_CMU_CALCTRL_UPSEL_HFXO << 24)         /**< Shifted mode HFXO for CMU_CALCTRL           */
#define CMU_CALCTRL_UPSEL_LFXO                  (_CMU_CALCTRL_UPSEL_LFXO << 24)         /**< Shifted mode LFXO for CMU_CALCTRL           */
#define CMU_CALCTRL_UPSEL_HFRCODPLL             (_CMU_CALCTRL_UPSEL_HFRCODPLL << 24)    /**< Shifted mode HFRCODPLL for CMU_CALCTRL      */
#define CMU_CALCTRL_UPSEL_HFRCOEM23             (_CMU_CALCTRL_UPSEL_HFRCOEM23 << 24)    /**< Shifted mode HFRCOEM23 for CMU_CALCTRL      */
#define CMU_CALCTRL_UPSEL_FSRCO                 (_CMU_CALCTRL_UPSEL_FSRCO << 24)        /**< Shifted mode FSRCO for CMU_CALCTRL          */
#define CMU_CALCTRL_UPSEL_LFRCO                 (_CMU_CALCTRL_UPSEL_LFRCO << 24)        /**< Shifted mode LFRCO for CMU_CALCTRL          */
#define CMU_CALCTRL_UPSEL_ULFRCO                (_CMU_CALCTRL_UPSEL_ULFRCO << 24)       /**< Shifted mode ULFRCO for CMU_CALCTRL         */
#define _CMU_CALCTRL_DOWNSEL_SHIFT              28                                      /**< Shift value for CMU_DOWNSEL                 */
#define _CMU_CALCTRL_DOWNSEL_MASK               0xF0000000UL                            /**< Bit mask for CMU_DOWNSEL                    */
#define _CMU_CALCTRL_DOWNSEL_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for CMU_CALCTRL                */
#define _CMU_CALCTRL_DOWNSEL_DISABLED           0x00000000UL                            /**< Mode DISABLED for CMU_CALCTRL               */
#define _CMU_CALCTRL_DOWNSEL_HCLK               0x00000001UL                            /**< Mode HCLK for CMU_CALCTRL                   */
#define _CMU_CALCTRL_DOWNSEL_PRS                0x00000002UL                            /**< Mode PRS for CMU_CALCTRL                    */
#define _CMU_CALCTRL_DOWNSEL_HFXO               0x00000003UL                            /**< Mode HFXO for CMU_CALCTRL                   */
#define _CMU_CALCTRL_DOWNSEL_LFXO               0x00000004UL                            /**< Mode LFXO for CMU_CALCTRL                   */
#define _CMU_CALCTRL_DOWNSEL_HFRCODPLL          0x00000005UL                            /**< Mode HFRCODPLL for CMU_CALCTRL              */
#define _CMU_CALCTRL_DOWNSEL_HFRCOEM23          0x00000006UL                            /**< Mode HFRCOEM23 for CMU_CALCTRL              */
#define _CMU_CALCTRL_DOWNSEL_FSRCO              0x00000009UL                            /**< Mode FSRCO for CMU_CALCTRL                  */
#define _CMU_CALCTRL_DOWNSEL_LFRCO              0x0000000AUL                            /**< Mode LFRCO for CMU_CALCTRL                  */
#define _CMU_CALCTRL_DOWNSEL_ULFRCO             0x0000000BUL                            /**< Mode ULFRCO for CMU_CALCTRL                 */
#define CMU_CALCTRL_DOWNSEL_DEFAULT             (_CMU_CALCTRL_DOWNSEL_DEFAULT << 28)    /**< Shifted mode DEFAULT for CMU_CALCTRL        */
#define CMU_CALCTRL_DOWNSEL_DISABLED            (_CMU_CALCTRL_DOWNSEL_DISABLED << 28)   /**< Shifted mode DISABLED for CMU_CALCTRL       */
#define CMU_CALCTRL_DOWNSEL_HCLK                (_CMU_CALCTRL_DOWNSEL_HCLK << 28)       /**< Shifted mode HCLK for CMU_CALCTRL           */
#define CMU_CALCTRL_DOWNSEL_PRS                 (_CMU_CALCTRL_DOWNSEL_PRS << 28)        /**< Shifted mode PRS for CMU_CALCTRL            */
#define CMU_CALCTRL_DOWNSEL_HFXO                (_CMU_CALCTRL_DOWNSEL_HFXO << 28)       /**< Shifted mode HFXO for CMU_CALCTRL           */
#define CMU_CALCTRL_DOWNSEL_LFXO                (_CMU_CALCTRL_DOWNSEL_LFXO << 28)       /**< Shifted mode LFXO for CMU_CALCTRL           */
#define CMU_CALCTRL_DOWNSEL_HFRCODPLL           (_CMU_CALCTRL_DOWNSEL_HFRCODPLL << 28)  /**< Shifted mode HFRCODPLL for CMU_CALCTRL      */
#define CMU_CALCTRL_DOWNSEL_HFRCOEM23           (_CMU_CALCTRL_DOWNSEL_HFRCOEM23 << 28)  /**< Shifted mode HFRCOEM23 for CMU_CALCTRL      */
#define CMU_CALCTRL_DOWNSEL_FSRCO               (_CMU_CALCTRL_DOWNSEL_FSRCO << 28)      /**< Shifted mode FSRCO for CMU_CALCTRL          */
#define CMU_CALCTRL_DOWNSEL_LFRCO               (_CMU_CALCTRL_DOWNSEL_LFRCO << 28)      /**< Shifted mode LFRCO for CMU_CALCTRL          */
#define CMU_CALCTRL_DOWNSEL_ULFRCO              (_CMU_CALCTRL_DOWNSEL_ULFRCO << 28)     /**< Shifted mode ULFRCO for CMU_CALCTRL         */

/* Bit fields for CMU CALCNT */
#define _CMU_CALCNT_RESETVALUE                  0x00000000UL                            /**< Default value for CMU_CALCNT                */
#define _CMU_CALCNT_MASK                        0x000FFFFFUL                            /**< Mask for CMU_CALCNT                         */
#define _CMU_CALCNT_CALCNT_SHIFT                0                                       /**< Shift value for CMU_CALCNT                  */
#define _CMU_CALCNT_CALCNT_MASK                 0xFFFFFUL                               /**< Bit mask for CMU_CALCNT                     */
#define _CMU_CALCNT_CALCNT_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for CMU_CALCNT                 */
#define CMU_CALCNT_CALCNT_DEFAULT               (_CMU_CALCNT_CALCNT_DEFAULT << 0)       /**< Shifted mode DEFAULT for CMU_CALCNT         */

