SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32SG28/Include/efr32sg28_cmu.h
/* Bit fields for CMU CLKEN1 */
#define _CMU_CLKEN1_RESETVALUE                  0x00000000UL                            /**< Default value for CMU_CLKEN1                */
#define _CMU_CLKEN1_MASK                        0x3FFFFFFFUL                            /**< Mask for CMU_CLKEN1                         */
#define CMU_CLKEN1_AGC                          (0x1UL << 0)                            /**< Enable Bus Clock                            */
#define _CMU_CLKEN1_AGC_SHIFT                   0                                       /**< Shift value for CMU_AGC                     */
#define _CMU_CLKEN1_AGC_MASK                    0x1UL                                   /**< Bit mask for CMU_AGC                        */
#define _CMU_CLKEN1_AGC_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for CMU_CLKEN1                 */
#define CMU_CLKEN1_AGC_DEFAULT                  (_CMU_CLKEN1_AGC_DEFAULT << 0)          /**< Shifted mode DEFAULT for CMU_CLKEN1         */
#define CMU_CLKEN1_MODEM                        (0x1UL << 1)                            /**< Enable Bus Clock                            */
#define _CMU_CLKEN1_MODEM_SHIFT                 1                                       /**< Shift value for CMU_MODEM                   */
#define _CMU_CLKEN1_MODEM_MASK                  0x2UL                                   /**< Bit mask for CMU_MODEM                      */
#define _CMU_CLKEN1_MODEM_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for CMU_CLKEN1                 */
#define CMU_CLKEN1_MODEM_DEFAULT                (_CMU_CLKEN1_MODEM_DEFAULT << 1)        /**< Shifted mode DEFAULT for CMU_CLKEN1         */
#define CMU_CLKEN1_RFCRC                        (0x1UL << 2)                            /**< Enable Bus Clock                            */
#define _CMU_CLKEN1_RFCRC_SHIFT                 2                                       /**< Shift value for CMU_RFCRC                   */
#define _CMU_CLKEN1_RFCRC_MASK                  0x4UL                                   /**< Bit mask for CMU_RFCRC                      */
#define _CMU_CLKEN1_RFCRC_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for CMU_CLKEN1                 */
#define CMU_CLKEN1_RFCRC_DEFAULT                (_CMU_CLKEN1_RFCRC_DEFAULT << 2)        /**< Shifted mode DEFAULT for CMU_CLKEN1         */
#define CMU_CLKEN1_FRC                          (0x1UL << 3)                            /**< Enable Bus Clock                            */
#define _CMU_CLKEN1_FRC_SHIFT                   3                                       /**< Shift value for CMU_FRC                     */
#define _CMU_CLKEN1_FRC_MASK                    0x8UL                                   /**< Bit mask for CMU_FRC                        */
#define _CMU_CLKEN1_FRC_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for CMU_CLKEN1                 */
#define CMU_CLKEN1_FRC_DEFAULT                  (_CMU_CLKEN1_FRC_DEFAULT << 3)          /**< Shifted mode DEFAULT for CMU_CLKEN1         */
#define CMU_CLKEN1_PROTIMER                     (0x1UL << 4)                            /**< Enable Bus Clock                            */
#define _CMU_CLKEN1_PROTIMER_SHIFT              4                                       /**< Shift value for CMU_PROTIMER                */
#define _CMU_CLKEN1_PROTIMER_MASK               0x10UL                                  /**< Bit mask for CMU_PROTIMER                   */
#define _CMU_CLKEN1_PROTIMER_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for CMU_CLKEN1                 */
#define CMU_CLKEN1_PROTIMER_DEFAULT             (_CMU_CLKEN1_PROTIMER_DEFAULT << 4)     /**< Shifted mode DEFAULT for CMU_CLKEN1         */
#define CMU_CLKEN1_RAC                          (0x1UL << 5)                            /**< Enable Bus Clock                            */
#define _CMU_CLKEN1_RAC_SHIFT                   5                                       /**< Shift value for CMU_RAC                     */
#define _CMU_CLKEN1_RAC_MASK                    0x20UL                                  /**< Bit mask for CMU_RAC                        */
#define _CMU_CLKEN1_RAC_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for CMU_CLKEN1                 */
#define CMU_CLKEN1_RAC_DEFAULT                  (_CMU_CLKEN1_RAC_DEFAULT << 5)          /**< Shifted mode DEFAULT for CMU_CLKEN1         */
#define CMU_CLKEN1_SYNTH                        (0x1UL << 6)                            /**< Enable Bus Clock                            */
#define _CMU_CLKEN1_SYNTH_SHIFT                 6                                       /**< Shift value for CMU_SYNTH                   */
#define _CMU_CLKEN1_SYNTH_MASK                  0x40UL                                  /**< Bit mask for CMU_SYNTH                      */
#define _CMU_CLKEN1_SYNTH_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for CMU_CLKEN1                 */
#define CMU_CLKEN1_SYNTH_DEFAULT                (_CMU_CLKEN1_SYNTH_DEFAULT << 6)        /**< Shifted mode DEFAULT for CMU_CLKEN1         */
#define CMU_CLKEN1_RFSCRATCHPAD                 (0x1UL << 7)                            /**< Enable Bus Clock                            */
#define _CMU_CLKEN1_RFSCRATCHPAD_SHIFT          7                                       /**< Shift value for CMU_RFSCRATCHPAD            */
#define _CMU_CLKEN1_RFSCRATCHPAD_MASK           0x80UL                                  /**< Bit mask for CMU_RFSCRATCHPAD               */
#define _CMU_CLKEN1_RFSCRATCHPAD_DEFAULT        0x00000000UL                            /**< Mode DEFAULT for CMU_CLKEN1                 */
#define CMU_CLKEN1_RFSCRATCHPAD_DEFAULT         (_CMU_CLKEN1_RFSCRATCHPAD_DEFAULT << 7) /**< Shifted mode DEFAULT for CMU_CLKEN1         */
#define CMU_CLKEN1_HOSTMAILBOX                  (0x1UL << 8)                            /**< Enable Bus Clock                            */
#define _CMU_CLKEN1_HOSTMAILBOX_SHIFT           8                                       /**< Shift value for CMU_HOSTMAILBOX             */
#define _CMU_CLKEN1_HOSTMAILBOX_MASK            0x100UL                                 /**< Bit mask for CMU_HOSTMAILBOX                */
#define _CMU_CLKEN1_HOSTMAILBOX_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for CMU_CLKEN1                 */
#define CMU_CLKEN1_HOSTMAILBOX_DEFAULT          (_CMU_CLKEN1_HOSTMAILBOX_DEFAULT << 8)  /**< Shifted mode DEFAULT for CMU_CLKEN1         */
#define CMU_CLKEN1_RFMAILBOX                    (0x1UL << 9)                            /**< Enable Bus Clock                            */
#define _CMU_CLKEN1_RFMAILBOX_SHIFT             9                                       /**< Shift value for CMU_RFMAILBOX               */
#define _CMU_CLKEN1_RFMAILBOX_MASK              0x200UL                                 /**< Bit mask for CMU_RFMAILBOX                  */
#define _CMU_CLKEN1_RFMAILBOX_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for CMU_CLKEN1                 */
#define CMU_CLKEN1_RFMAILBOX_DEFAULT            (_CMU_CLKEN1_RFMAILBOX_DEFAULT << 9)    /**< Shifted mode DEFAULT for CMU_CLKEN1         */
#define CMU_CLKEN1_SEMAILBOXHOST                (0x1UL << 10)                           /**< Enable Bus Clock                            */
#define _CMU_CLKEN1_SEMAILBOXHOST_SHIFT         10                                      /**< Shift value for CMU_SEMAILBOXHOST           */
#define _CMU_CLKEN1_SEMAILBOXHOST_MASK          0x400UL                                 /**< Bit mask for CMU_SEMAILBOXHOST              */
#define _CMU_CLKEN1_SEMAILBOXHOST_DEFAULT       0x00000000UL                            /**< Mode DEFAULT for CMU_CLKEN1                 */
#define CMU_CLKEN1_SEMAILBOXHOST_DEFAULT        (_CMU_CLKEN1_SEMAILBOXHOST_DEFAULT << 10) /**< Shifted mode DEFAULT for CMU_CLKEN1         */
#define CMU_CLKEN1_BUFC                         (0x1UL << 11)                           /**< Enable Bus Clock                            */
#define _CMU_CLKEN1_BUFC_SHIFT                  11                                      /**< Shift value for CMU_BUFC                    */
#define _CMU_CLKEN1_BUFC_MASK                   0x800UL                                 /**< Bit mask for CMU_BUFC                       */
#define _CMU_CLKEN1_BUFC_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for CMU_CLKEN1                 */
#define CMU_CLKEN1_BUFC_DEFAULT                 (_CMU_CLKEN1_BUFC_DEFAULT << 11)        /**< Shifted mode DEFAULT for CMU_CLKEN1         */
#define CMU_CLKEN1_LCD                          (0x1UL << 12)                           /**< Enable Bus Clock                            */
#define _CMU_CLKEN1_LCD_SHIFT                   12                                      /**< Shift value for CMU_LCD                     */
#define _CMU_CLKEN1_LCD_MASK                    0x1000UL                                /**< Bit mask for CMU_LCD                        */
#define _CMU_CLKEN1_LCD_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for CMU_CLKEN1                 */
#define CMU_CLKEN1_LCD_DEFAULT                  (_CMU_CLKEN1_LCD_DEFAULT << 12)         /**< Shifted mode DEFAULT for CMU_CLKEN1         */
#define CMU_CLKEN1_KEYSCAN                      (0x1UL << 13)                           /**< Enable Bus Clock                            */
#define _CMU_CLKEN1_KEYSCAN_SHIFT               13                                      /**< Shift value for CMU_KEYSCAN                 */
#define _CMU_CLKEN1_KEYSCAN_MASK                0x2000UL                                /**< Bit mask for CMU_KEYSCAN                    */
#define _CMU_CLKEN1_KEYSCAN_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for CMU_CLKEN1                 */
#define CMU_CLKEN1_KEYSCAN_DEFAULT              (_CMU_CLKEN1_KEYSCAN_DEFAULT << 13)     /**< Shifted mode DEFAULT for CMU_CLKEN1         */
#define CMU_CLKEN1_SMU                          (0x1UL << 14)                           /**< Enable Bus Clock                            */
#define _CMU_CLKEN1_SMU_SHIFT                   14                                      /**< Shift value for CMU_SMU                     */
#define _CMU_CLKEN1_SMU_MASK                    0x4000UL                                /**< Bit mask for CMU_SMU                        */
#define _CMU_CLKEN1_SMU_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for CMU_CLKEN1                 */
#define CMU_CLKEN1_SMU_DEFAULT                  (_CMU_CLKEN1_SMU_DEFAULT << 14)         /**< Shifted mode DEFAULT for CMU_CLKEN1         */
#define CMU_CLKEN1_ICACHE0                      (0x1UL << 15)                           /**< Enable Bus Clock                            */
#define _CMU_CLKEN1_ICACHE0_SHIFT               15                                      /**< Shift value for CMU_ICACHE0                 */
#define _CMU_CLKEN1_ICACHE0_MASK                0x8000UL                                /**< Bit mask for CMU_ICACHE0                    */
#define _CMU_CLKEN1_ICACHE0_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for CMU_CLKEN1                 */
#define CMU_CLKEN1_ICACHE0_DEFAULT              (_CMU_CLKEN1_ICACHE0_DEFAULT << 15)     /**< Shifted mode DEFAULT for CMU_CLKEN1         */
#define CMU_CLKEN1_MSC                          (0x1UL << 16)                           /**< Enable Bus Clock                            */
#define _CMU_CLKEN1_MSC_SHIFT                   16                                      /**< Shift value for CMU_MSC                     */
#define _CMU_CLKEN1_MSC_MASK                    0x10000UL                               /**< Bit mask for CMU_MSC                        */
#define _CMU_CLKEN1_MSC_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for CMU_CLKEN1                 */
#define CMU_CLKEN1_MSC_DEFAULT                  (_CMU_CLKEN1_MSC_DEFAULT << 16)         /**< Shifted mode DEFAULT for CMU_CLKEN1         */
#define CMU_CLKEN1_WDOG1                        (0x1UL << 17)                           /**< Enable Bus Clock                            */
#define _CMU_CLKEN1_WDOG1_SHIFT                 17                                      /**< Shift value for CMU_WDOG1                   */
#define _CMU_CLKEN1_WDOG1_MASK                  0x20000UL                               /**< Bit mask for CMU_WDOG1                      */
#define _CMU_CLKEN1_WDOG1_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for CMU_CLKEN1                 */
#define CMU_CLKEN1_WDOG1_DEFAULT                (_CMU_CLKEN1_WDOG1_DEFAULT << 17)       /**< Shifted mode DEFAULT for CMU_CLKEN1         */
#define CMU_CLKEN1_ACMP0                        (0x1UL << 18)                           /**< Enable Bus Clock                            */
#define _CMU_CLKEN1_ACMP0_SHIFT                 18                                      /**< Shift value for CMU_ACMP0                   */
#define _CMU_CLKEN1_ACMP0_MASK                  0x40000UL                               /**< Bit mask for CMU_ACMP0                      */
#define _CMU_CLKEN1_ACMP0_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for CMU_CLKEN1                 */
#define CMU_CLKEN1_ACMP0_DEFAULT                (_CMU_CLKEN1_ACMP0_DEFAULT << 18)       /**< Shifted mode DEFAULT for CMU_CLKEN1         */
#define CMU_CLKEN1_ACMP1                        (0x1UL << 19)                           /**< Enable Bus Clock                            */
#define _CMU_CLKEN1_ACMP1_SHIFT                 19                                      /**< Shift value for CMU_ACMP1                   */
#define _CMU_CLKEN1_ACMP1_MASK                  0x80000UL                               /**< Bit mask for CMU_ACMP1                      */
#define _CMU_CLKEN1_ACMP1_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for CMU_CLKEN1                 */
#define CMU_CLKEN1_ACMP1_DEFAULT                (_CMU_CLKEN1_ACMP1_DEFAULT << 19)       /**< Shifted mode DEFAULT for CMU_CLKEN1         */
#define CMU_CLKEN1_VDAC0                        (0x1UL << 20)                           /**< Enable Bus Clock                            */
#define _CMU_CLKEN1_VDAC0_SHIFT                 20                                      /**< Shift value for CMU_VDAC0                   */
#define _CMU_CLKEN1_VDAC0_MASK                  0x100000UL                              /**< Bit mask for CMU_VDAC0                      */
#define _CMU_CLKEN1_VDAC0_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for CMU_CLKEN1                 */
#define CMU_CLKEN1_VDAC0_DEFAULT                (_CMU_CLKEN1_VDAC0_DEFAULT << 20)       /**< Shifted mode DEFAULT for CMU_CLKEN1         */
#define CMU_CLKEN1_PCNT0                        (0x1UL << 21)                           /**< Enable Bus Clock                            */
#define _CMU_CLKEN1_PCNT0_SHIFT                 21                                      /**< Shift value for CMU_PCNT0                   */
#define _CMU_CLKEN1_PCNT0_MASK                  0x200000UL                              /**< Bit mask for CMU_PCNT0                      */
#define _CMU_CLKEN1_PCNT0_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for CMU_CLKEN1                 */
#define CMU_CLKEN1_PCNT0_DEFAULT                (_CMU_CLKEN1_PCNT0_DEFAULT << 21)       /**< Shifted mode DEFAULT for CMU_CLKEN1         */
#define CMU_CLKEN1_EUSART0                      (0x1UL << 22)                           /**< Enable Bus Clock                            */
#define _CMU_CLKEN1_EUSART0_SHIFT               22                                      /**< Shift value for CMU_EUSART0                 */
#define _CMU_CLKEN1_EUSART0_MASK                0x400000UL                              /**< Bit mask for CMU_EUSART0                    */
#define _CMU_CLKEN1_EUSART0_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for CMU_CLKEN1                 */
#define CMU_CLKEN1_EUSART0_DEFAULT              (_CMU_CLKEN1_EUSART0_DEFAULT << 22)     /**< Shifted mode DEFAULT for CMU_CLKEN1         */
#define CMU_CLKEN1_EUSART1                      (0x1UL << 23)                           /**< Enable Bus Clock                            */
#define _CMU_CLKEN1_EUSART1_SHIFT               23                                      /**< Shift value for CMU_EUSART1                 */
#define _CMU_CLKEN1_EUSART1_MASK                0x800000UL                              /**< Bit mask for CMU_EUSART1                    */
#define _CMU_CLKEN1_EUSART1_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for CMU_CLKEN1                 */
#define CMU_CLKEN1_EUSART1_DEFAULT              (_CMU_CLKEN1_EUSART1_DEFAULT << 23)     /**< Shifted mode DEFAULT for CMU_CLKEN1         */
#define CMU_CLKEN1_EUSART2                      (0x1UL << 24)                           /**< Enable Bus Clock                            */
#define _CMU_CLKEN1_EUSART2_SHIFT               24                                      /**< Shift value for CMU_EUSART2                 */
#define _CMU_CLKEN1_EUSART2_MASK                0x1000000UL                             /**< Bit mask for CMU_EUSART2                    */
#define _CMU_CLKEN1_EUSART2_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for CMU_CLKEN1                 */
#define CMU_CLKEN1_EUSART2_DEFAULT              (_CMU_CLKEN1_EUSART2_DEFAULT << 24)     /**< Shifted mode DEFAULT for CMU_CLKEN1         */
#define CMU_CLKEN1_RFECA0                       (0x1UL << 25)                           /**< Enable Bus Clock                            */
#define _CMU_CLKEN1_RFECA0_SHIFT                25                                      /**< Shift value for CMU_RFECA0                  */
#define _CMU_CLKEN1_RFECA0_MASK                 0x2000000UL                             /**< Bit mask for CMU_RFECA0                     */
#define _CMU_CLKEN1_RFECA0_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for CMU_CLKEN1                 */
#define CMU_CLKEN1_RFECA0_DEFAULT               (_CMU_CLKEN1_RFECA0_DEFAULT << 25)      /**< Shifted mode DEFAULT for CMU_CLKEN1         */
#define CMU_CLKEN1_RFECA1                       (0x1UL << 26)                           /**< Enable Bus Clock                            */
#define _CMU_CLKEN1_RFECA1_SHIFT                26                                      /**< Shift value for CMU_RFECA1                  */
#define _CMU_CLKEN1_RFECA1_MASK                 0x4000000UL                             /**< Bit mask for CMU_RFECA1                     */
#define _CMU_CLKEN1_RFECA1_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for CMU_CLKEN1                 */
#define CMU_CLKEN1_RFECA1_DEFAULT               (_CMU_CLKEN1_RFECA1_DEFAULT << 26)      /**< Shifted mode DEFAULT for CMU_CLKEN1         */
#define CMU_CLKEN1_DMEM                         (0x1UL << 27)                           /**< Enable Bus Clock                            */
#define _CMU_CLKEN1_DMEM_SHIFT                  27                                      /**< Shift value for CMU_DMEM                    */
#define _CMU_CLKEN1_DMEM_MASK                   0x8000000UL                             /**< Bit mask for CMU_DMEM                       */
#define _CMU_CLKEN1_DMEM_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for CMU_CLKEN1                 */
#define CMU_CLKEN1_DMEM_DEFAULT                 (_CMU_CLKEN1_DMEM_DEFAULT << 27)        /**< Shifted mode DEFAULT for CMU_CLKEN1         */
#define CMU_CLKEN1_ECAIFADC                     (0x1UL << 28)                           /**< Enable Bus Clock                            */
#define _CMU_CLKEN1_ECAIFADC_SHIFT              28                                      /**< Shift value for CMU_ECAIFADC                */
#define _CMU_CLKEN1_ECAIFADC_MASK               0x10000000UL                            /**< Bit mask for CMU_ECAIFADC                   */
#define _CMU_CLKEN1_ECAIFADC_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for CMU_CLKEN1                 */
#define CMU_CLKEN1_ECAIFADC_DEFAULT             (_CMU_CLKEN1_ECAIFADC_DEFAULT << 28)    /**< Shifted mode DEFAULT for CMU_CLKEN1         */
#define CMU_CLKEN1_MVP                          (0x1UL << 29)                           /**< Enable Bus Clock                            */
#define _CMU_CLKEN1_MVP_SHIFT                   29                                      /**< Shift value for CMU_MVP                     */
#define _CMU_CLKEN1_MVP_MASK                    0x20000000UL                            /**< Bit mask for CMU_MVP                        */
#define _CMU_CLKEN1_MVP_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for CMU_CLKEN1                 */
#define CMU_CLKEN1_MVP_DEFAULT                  (_CMU_CLKEN1_MVP_DEFAULT << 29)         /**< Shifted mode DEFAULT for CMU_CLKEN1         */

